[
{
  "converted_data": {
    "job_title": "Front-End Developer",
    "company": "FED IT",
    "location": "Montréal, QC",
    "salary": "$70,000–$90,000 a year",
    "job_description": "The role involves designing, implementing, and testing code using technologies like Nest.js and Angular. It is a permanent, hybrid position with responsibilities including improving software development processes and maintaining documentation.",
    "requirements": "Candidates should have a DEC in computer science, at least 2 years of software development experience, and proficiency in NestJS or Node.js, Angular, HTML, CSS, and JavaScript. Experience with Google Cloud Platform and .NET is a plus."
  },
  "source_url": "https://ca.indeed.com/viewjob?jk=b2b3bbf253537d62&from=serp&vjs=3"
},
{
  "converted_data": {
    "job_title": "Développeur(euse) Front-End Angular",
    "company": "TCI+",
    "location": "2075 Boulevard Fortin, Laval, QC H7S 1P4",
    "salary": "$85,000–$105,000 a year",
    "job_description": "Filiale de VINCI Energies, TCI+ est le leader en transition énergétique et en transformation numérique au Québec. Les responsabilités incluent la modernisation du Front-End, le développement de nouvelles fonctionnalités, et la collaboration avec l’équipe.",
    "requirements": "Maîtrise d’Angular (v17+) et de TypeScript, expérience avec Material Design et RxJS, connaissance des API REST, optimisation des performances, tests unitaires et end-to-end, expérience avec Fabric.js et CI/CD avec Azure DevOps (un atout)."
  },
  "source_url": "https://ca.indeed.com/viewjob?jk=1778a3e399f7f618&from=serp&vjs=3"
},
{
  "converted_data": {
    "job_title": "Software Developer (Back-End Focus)",
    "company": "VIREC Intelligence Inc.",
    "location": "Montréal, QC H1W 2M1",
    "salary": "$72,500–$88,000 a year",
    "job_description": "Join our advanced technology team as a Software Developer, focusing on designing, developing, and optimizing platform and cloud-based solutions. Collaborate with cross-functional teams to drive innovations in back-end engineering.",
    "requirements": "Bachelor’s degree in Computer Science or related field, minimum 5 years of back-end software development experience, proficiency in Python, Azure expertise, and strong communication skills."
  },
  "source_url": "https://ca.indeed.com/viewjob?jk=6a8e9c486fca404c&from=serp&vjs=3"
},
{
  "converted_data": {
    "job_title": "Front-End Software Developer (Montreal QC)",
    "company": "Montrium Inc",
    "location": "Montréal, QC H2Y 2W8",
    "salary": "Not specified",
    "job_description": "The Front-End software developer is responsible for creating and implementing the visual and interactive elements of the Montrium Connect applications, including UI designs and layouts. They collaborate with designers and Back-End developers.",
    "requirements": "5 years of experience in front-end software development, strong programming skills, fluency in English and French, and experience with technologies like TypeScript, React, and GraphQL."
  },
  "source_url": "https://ca.indeed.com/viewjob?jk=17f27eca69ef9423&from=serp&vjs=3"
},
{
  "converted_data": {
    "job_title": "Product Designer Intern",
    "company": "Cogeco Connexion Inc",
    "location": "Montréal, QC",
    "salary": "Not specified",
    "job_description": "Join our dynamic team for a thrilling internship experience! You will work on exciting projects, develop new skills, and network with industry leaders. The internship program runs full-time from May 26th 2025 - August 29th 2025.",
    "requirements": "Current enrollment in an undergraduate program in Design or related fields. Proficiency in design tools like Figma and a portfolio showcasing design work are required. Strong communication skills and ability to collaborate in a team-oriented environment."
  },
  "source_url": "https://ca.indeed.com/viewjob?jk=a28036c354a75d40&from=serp&vjs=3"
},
{
  "converted_data": {
    "job_title": "Java Spring developer",
    "company": "Desjardins",
    "location": "Montréal, QC H1B 1N8",
    "salary": "Competitive salary and annual bonus",
    "job_description": "Be part of the largest private IT team in Quebec, working on meaningful projects in agile mode. Responsibilities include analyzing client needs, designing solutions, and developing IT applications.",
    "requirements": "Professional experience as a developer, knowledge of Java, Spring, Angular, TypeScript, microservices, and cloud platforms. Knowledge of French is required."
  },
  "source_url": "https://ca.indeed.com/viewjob?jk=851ab809c2a03cf2&from=serp&vjs=3"
},
{
  "converted_data": {
    "job_title": "Python Developer",
    "company": "Bounteous",
    "location": "Montréal, QC",
    "salary": "$70,000–$90,000 a year",
    "job_description": "Bounteous is a digital transformation consultancy that partners with brands to create digital solutions. They focus on strategy, analytics, digital engineering, and more. The role requires strong Python development skills and experience with various technologies.",
    "requirements": "6+ years of Python development experience, understanding of Python stacks and frameworks, familiarity with SQL and NoSQL, problem-solving skills, knowledge of Spark, Bigdata, Cloud, and Machine Learning technologies, and front-end development experience with HTML, CSS, Angular, and JavaScript."
  },
  "source_url": "https://ca.indeed.com/viewjob?jk=f05fed6de0de3f04&from=serp&vjs=3"
},
{
  "converted_data": {
    "job_title": "IOS - Mobile Software Engineer",
    "company": "Infotree Global Solutions",
    "location": "Montréal, QC H8Y 2T6",
    "salary": "$50–$55 an hour",
    "job_description": "The role involves designing and developing iOS applications, contributing to Backend For Frontend (BFF) development, collaborating with cross-functional teams, and producing thorough technical documentation.",
    "requirements": "Proficiency in Swift and Python, experience with iOS frameworks, understanding of RESTful APIs, familiarity with version control systems, and strong problem-solving and communication skills."
  },
  "source_url": "https://ca.indeed.com/viewjob?jk=dff2040a65773386&from=serp&vjs=3"
},
{
  "converted_data": {
    "job_title": "Python Developer",
    "company": "Accolite Digitial",
    "location": "Montréal, QC",
    "salary": "$70,000–$90,000 a year",
    "job_description": "Bounteous is a digital transformation consultancy that partners with brands to create digital solutions. They focus on technical expertise and deliver innovative solutions in various fields.",
    "requirements": "6+ years of experience as a Python Developer, understanding of Python stacks and frameworks, familiarity with SQL and NoSQL, problem-solving skills, knowledge of Spark, Bigdata, Cloud, and Machine Learning technologies."
  },
  "source_url": "https://ca.indeed.com/viewjob?jk=b59e97afeeea4aa6&from=serp&vjs=3"
},
{
  "converted_data": {
    "job_title": "Développeur PHP Intermédiaire - CodeIgniter & Laravel",
    "company": "illuxi",
    "location": "Montréal, QC H3L 2R3",
    "salary": "$80,000–$90,000 a year",
    "job_description": "Role involves developing and optimizing web platforms, designing, programming, and maintaining SaaS solutions, collaborating with product teams, and ensuring application performance and security.",
    "requirements": "University degree in computer science or related field, 5 years of PHP development experience, proficiency in CodeIgniter and Laravel, strong understanding of MVC and service-oriented architectures, bilingual in French and English."
  },
  "source_url": "https://ca.indeed.com/viewjob?jk=5ca2dcdcc5d260e6&from=serp&vjs=3"
},
{
  "converted_data": {
    "job_title": "Développeur frontend senior - Senior Frontend Developer",
    "company": "OneSpan",
    "location": "Montréal, QC",
    "salary": null,
    "job_description": "OneSpan is looking for a Senior Frontend Developer to join our team in Montreal, Canada. We are building digital signature applications with cutting edge frontend technologies like react, ExpressJs and GraphQL. You will have a chance to contribute to a highly maintained, widely test covered software written with all the advance toolings and design patterns.",
    "requirements": "Minimum 5 years of experience in web application design/development, strong experience with end-to-end release and deployment, deep knowledge in HTML5, CSS, JavaScript, React, and NPM. Experience with TDD and continuous integration, solid experience with version control tools, preferably git."
  },
  "source_url": "https://ca.indeed.com/viewjob?jk=df6e3a54f68eef99&from=serp&vjs=3"
}
]