[
{"converted_data": "```json\n{\n  \"job_title\": \"Software Developer - AI Trainer (Contract)\",\n  \"company\": \"DataAnnotation\",\n  \"location\": \"Montréal, QC\",\n  \"salary\": \"From $56.80 an hour\",\n  \"job_description\": \"We are looking for proficient programmers to join our team to train our AI chatbots to code. You will work with the chatbots that we are building in order to measure their progress, as well as write and evaluate code.\\n\\nTo apply to this role, you will need to be proficient in either Python and/or JavaScript. Your role will require proficiency in at least one programming language (JavaScript, Python, C#, C++, HTML, SQL, or Swift) in order to solve coding problems (think LeetCode, HackerRank, etc). For each coding problem, you must be able to explain how your solution solves the problem.\\n\\nAs part of the application process, you will be asked to complete an assessment. If you pass, you will gain access to projects. Based on the quality of your work, you will continue to receive projects regularly. We find our most successful candidates work between 5-20 hours per week, up to 40 hours.\\n\\nBenefits:\\n- This is a full-time or part-time REMOTE position\\n- You’ll be able to choose which projects you want to work on\\n- You can work on your own schedule\\n- Projects are paid hourly, starting at $40 USD/hour, with bonuses on high-quality and high-volume work\\n\\nResponsibilities:\\n- Come up with diverse problems and solutions for a coding chatbot\\n- Write high-quality answers and code snippets\\n- Evaluate code quality produced by AI models for correctness and performance\\n\\nQualifications:\\n- Fluency in English (native or bilingual level)\\n- Proficient in either Python and/or JavaScript\\n- Detail-oriented\\n- Excellent writing and grammar skills\\n- A bachelor's degree (completed or in progress)\\n\\nNote: Payment is made via PayPal. We will never ask for any money from you. PayPal will handle any currency conversions from USD.\",\n  \"requirements\": [\n    \"Fluency in English (native or bilingual level)\",\n    \"Proficient in either Python and/or JavaScript\",\n    \"Detail-oriented\",\n    \"Excellent writing and grammar skills\",\n    \"A bachelor's degree (completed or in progress)\"\n  ]\n}\n```", "source_url": "https://ca.indeed.com/viewjob?jk=6e1c13425b5d98d8&from=serp&vjs=3"},
{"converted_data": "```json\n{\n  \"job_title\": \"Full Stack Developer\",\n  \"company\": \"Maya HTT\",\n  \"location\": \"Montréal, QC\",\n  \"salary\": \"Competitive Base Salary\",\n  \"job_description\": \"Maya HTT is a world leading software developer and engineering solutions provider focused on CAE, CAD, CAM and PLM. A long-time partner of Siemens Digital Industries Software, Maya HTT collaborates in providing software, AI, and engineering services to help clients and partners worldwide boost performance, improve quality, drive down costs, and harness the value of their data.\\n\\nWe are seeking a skilled Full-Stack Software Developer to join our team in developing innovative Computer-Aided Engineering (CAE) applications. You will be responsible for designing, developing, and maintaining both the frontend and backend of cloud-based CAE solutions. This role offers the opportunity to work with cutting-edge technologies, including 3D visualization on the web, and contribute to the development of applications that support complex engineering simulations. The ideal candidate is enthusiastic about learning new technologies and expanding their skill set.\",\n  \"requirements\": {\n    \"required_qualifications\": [\n      \"Bachelor's degree in Computer Science, Software Engineering, or a related field (or equivalent work experience).\",\n      \"3+ years of experience in full-stack software development.\",\n      \"Strong proficiency in C#, Node.js, React, and Typescript.\",\n      \"Experience with Microsoft Azure cloud services, including Azure functions, storage, and security.\",\n      \"Experience with 3D visualization on the web, including WebGL or similar technologies.\",\n      \"Solid understanding of front-end technologies, including HTML5, CSS3, and modern JavaScript frameworks.\",\n      \"Knowledge of RESTful APIs and backend services.\",\n      \"Familiarity with version control systems like Git.\",\n      \"Strong problem-solving and analytical skills.\",\n      \"Excellent communication and teamwork skills.\",\n      \"Willingness to learn new technologies and adapt to evolving industry trends.\"\n    ],\n    \"preferred_qualifications\": [\n      \"Experience with CAE or similar engineering applications.\",\n      \"Knowledge of CI/CD pipelines and automated testing frameworks.\",\n      \"Familiarity with database management systems (e.g., SQL Server, Azure SQL).\",\n      \"Understanding of Agile development methodologies.\"\n    ]\n  }\n}\n```", "source_url": "https://ca.indeed.com/viewjob?jk=491c82391b79ee4c&from=serp&vjs=3"},
{"converted_data": "```json\n{\n  \"job_title\": \"Scala Developer - 9740848\",\n  \"company\": \"APPTOZA INC.\",\n  \"location\": \"Montréal, QC\",\n  \"salary\": \"Not specified\",\n  \"job_description\": \"Job title: Scala Developer\\nLocation: Montreal, QC\\nDuration: Fulltime\\n\\nJob Description:\\n- 4+ Years of technical experience in a full stack developer role\\n- Strong proficiency with Python\\n- Database experience preferably with Snowflake\\n- Complete SDLC process and Agile Methodology (Scrum)\\n\\nSkill Desired:\\n- Strong proficiency with Java or Scala, Scala-Spark or PySpark\\n- Previous experience in front office and back-office reports\\n- Strong understanding of Order Life Cycle Management from Equities and Listed Derivatives perspective\\n- Previous experience in Trade Surveillance or working with data from the order lifecycle\\n- Good to have knowledge on Big Data Technologies\\n- High Quality software architecture and design methodologies and patterns\\n- Work experience as a level-3 support for applications\\n- Layered Architecture, Component based Architecture\\n\\nMandatory Skills:\\n- Strong Python\\n- Strong Java or Scala, Scala-Spark or PySpark\\n- Previous Trade Surveillance (or) Working with data from the Order Cycle\\n\\nJob Type: Fixed term contract\\n\\nSchedule:\\n- 8 hour shift\\n\\nEducation:\\n- Bachelor's Degree (preferred)\\n\\nLanguage:\\n- English (preferred)\",\n  \"requirements\": [\n    \"4+ Years of technical experience in a full stack developer role\",\n    \"Strong proficiency with Python\",\n    \"Database experience preferably with Snowflake\",\n    \"Complete SDLC process and Agile Methodology (Scrum)\",\n    \"Strong proficiency with Java or Scala, Scala-Spark or PySpark\",\n    \"Previous experience in front office and back-office reports\",\n    \"Strong understanding of Order Life Cycle Management from Equities and Listed Derivatives perspective\",\n    \"Previous experience in Trade Surveillance or working with data from the order lifecycle\",\n    \"Good to have knowledge on Big Data Technologies\",\n    \"High Quality software architecture and design methodologies and patterns\",\n    \"Work experience as a level-3 support for applications\",\n    \"Layered Architecture, Component based Architecture\",\n    \"Bachelor's Degree (preferred)\",\n    \"English (preferred)\"\n  ]\n}\n```", "source_url": "https://ca.indeed.com/viewjob?jk=86b59afcea8bb6d1&from=serp&vjs=3"},
{"converted_data": "```json\n{\n  \"job_title\": \".Net Developer - 9859924\",\n  \"company\": \"APPTOZA INC.\",\n  \"location\": \"Montréal, QC\",\n  \"salary\": \"Not specified\",\n  \"job_description\": \"Job Title: .Net Developer\\nLocation: Montreal, QC\\nDuration: Long Term Contract\\n\\nJob Description:\\n- SQL Server, Angular Typescript, Angular Hands-on experience with web services, APIs, and REST.\\n- Scripting experience with languages such as PowerShell.\\n\\nJob Type: Fixed term contract\\n\\nSchedule:\\n- 8 hour shift\\n\\nEducation:\\n- Bachelor's Degree (preferred)\\n\\nLanguage:\\n- English (preferred)\",\n  \"requirements\": [\n    \"SQL Server\",\n    \"Angular Typescript\",\n    \"Experience with web services, APIs, and REST\",\n    \"Scripting experience with languages such as PowerShell\",\n    \"Bachelor's Degree (preferred)\",\n    \"English (preferred)\"\n  ]\n}\n```", "source_url": "https://ca.indeed.com/viewjob?jk=2f10a35760ec75ad&from=serp&vjs=3"},
{"converted_data": "```json\n{\n  \"job_title\": \"Principal Cloud Solutions Architect\",\n  \"company\": \"Future Electronics\",\n  \"location\": \"Pointe-Claire, QC H9R 5C7\",\n  \"salary\": \"From $90,000 a year\",\n  \"job_description\": \"The Principal Cloud Solutions Architect will be responsible for designing cloud solutions that meet business needs, specifically aligning with Microsoft Azure technologies and services. This individual will be required to work with and mentor senior infrastructure team members and aid in cross training the teams cloud abilities. What you’ll be working on: Design Azure IaaS solutions following best practices with regards to security, policies, standards and automation to meet specific business needs. Design and help configure and manage Azure VMWare Services. Aid in tracking and managing cloud spend. Design DR solutions for any production cloud workloads. Monitor and report on DR system performance, conducting regular reviews and updates. Conduct risk assessments and business impact analyses to identify critical systems and data. Assist in cloud readiness activities, helping to align existing internal services with cloud compatible technologies. Design and assist in configuring and managing Azure backup solutions for all cloud services. Collaborate with incident response teams to manage and mitigate any disruptions or failures during disasters. Identify opportunities for improving processes and technologies based on industry trends and organizational feedback. Mentor other infrastructure team members in cloud technologies, helping to train and transfer operational roles to other team members. Perform other duties as required.\",\n  \"requirements\": [\n    \"Bachelor’s degree in computer sciences\",\n    \"10+ years of experience with network and systems administration with a focus on Azure cloud solutions\",\n    \"Proven experience in disaster recovery planning and execution in Azure environments.\",\n    \"Strong understanding of Azure services and close Azure partners, such as Azure VMWare Services.\",\n    \"Familiarity with networking, security, and compliance considerations in disaster recovery.\",\n    \"Relevant Azure certifications (e.g., Microsoft Certified: Azure Solutions Architect) are advantageous.\",\n    \"Excellent analytical, problem-solving, and communication skills.\",\n    \"Ability to work collaboratively in a fast-paced environment.\",\n    \"Strong networking skills\",\n    \"Scripting languages (VBScript, PowerShell, Python)\",\n    \"Experience with installing and/or managing Linux is a plus\"\n  ]\n}\n```", "source_url": "https://ca.indeed.com/viewjob?jk=d1b6688f007f905a&from=serp&vjs=3"},
{"converted_data": "```json\n{\n  \"job_title\": \"Intern, Software Development (Summer 2025)\",\n  \"company\": \"Bombardier\",\n  \"location\": \"Dorval, QC\",\n  \"salary\": null,\n  \"job_description\": \"Innovation is in our DNA… is it in yours? Bombardier is a global leader in aviation, creating innovative and game-changing planes. Our products and services provide world-class experiences that set new standards in passenger comfort, energy efficiency, reliability and safety. We are a global organization focused on working together with a team spirit.\\n\\nYour boarding pass will include…\\n\\nSeveral conferences, including:\\n- Meet An Executive\\n- Women Taking Flight\\n\\nLearning more about Bombardier, including:\\n- Bombardier Products conference\\n- Visits of the Bombardier sites\\n- Bombardier Academy of Learning\\n\\nMany social/networking opportunities, including:\\n- Volunteering\\n- Networking for Success\\n- 5 à 7, Potluck, and much more!\\n\\nWhat are your contributions to the team?\\n- Participate in all aspects of agile software development, from implementation to deployment of web-based applications.\\n- Help in development new features in support of evolving business and project requirements.\\n- Participate in all aspects of the SDLC from a project’s initiation to release and post-release support.\\n- Write clean & efficient code using best practices.\\n- Write and validate test procedures. Write unit tests.\\n- Communicate risks and issues to the delivery manager and propose potential mitigation plans.\\n\\nHow to thrive in this role?\\n- You possess knowledge of two or more of the following: XML/JSON, Node.js, REACT, Python and SQL.\\n- You have completed at least one internship in software development.\\n- You have a strong understanding of an Agile Software Development environment.\\n- You are pro-active, flexible and have solid critical thinking skills. You have a strong sense of accountability and autonomy, and you focus on outcomes. You always look for ideas and suggestions to make improvements.\\n\\nBoarding Information:\\n- Location: Administrative Centre (CA)\\n- Duration: 8 months\\n- Virtual or on site\\n\\nIt is important to note that our internship opportunities are open to students only, not new graduates. All our interns may be required to occasionally travel outside of Canada for training/work purpose.\",\n  \"requirements\": [\n    \"Knowledge of", "source_url": "https://ca.indeed.com/viewjob?jk=74358ee20e962273&from=serp&vjs=3"}
]