[
{
  "converted_data": {
    "job_title": "Software Developer - AI Trainer (Contract)",
    "company": "DataAnnotation",
    "location": "Montréal, QC",
    "salary": "From $56.80 an hour",
    "job_description": "Looking for proficient programmers to train AI chatbots to code, requiring proficiency in Python and/or JavaScript. Candidates will complete an assessment and can work remotely.",
    "requirements": "Proficiency in at least one programming language (JavaScript, Python, C#, C++, HTML, SQL, or Swift), fluency in English, detail-oriented, excellent writing skills, and a bachelor's degree (completed or in progress)."
  },
  "source_url": "https://ca.indeed.com/viewjob?jk=6e1c13425b5d98d8&from=serp&vjs=3"
},
{
  "converted_data": {
    "job_title": "Full Stack Developer",
    "company": "Maya HTT",
    "location": "Montréal, QC",
    "salary": "Competitive Base Salary",
    "job_description": "Maya HTT is a leading software developer seeking a Full-Stack Software Developer to design, develop, and maintain cloud-based CAE applications, utilizing technologies like Microsoft Azure, C#, Node.js, React, and Typescript.",
    "requirements": "Bachelor's degree in Computer Science or related field, 3+ years of full-stack development experience, proficiency in C#, Node.js, React, and Typescript, experience with Microsoft Azure, and strong problem-solving skills."
  },
  "source_url": "https://ca.indeed.com/viewjob?jk=491c82391b79ee4c&from=serp&vjs=3"
},
{
  "converted_data": {
    "job_title": "Developer / Programmeur Intermédiaire (Full-Stack)",
    "company": "Uman3D",
    "location": "6666 Rue Saint-Urbain, Montréal, QC",
    "salary": "$75,000–$100,000 a year",
    "job_description": "As a intermediate Developer, you will assist in designing and implementing web applications, utilizing skills in SQL, JavaScript, C#, and .NET. Familiarity with Agile methodologies and version control systems like Git is essential.",
    "requirements": "Direct programming background, experience with object-oriented programming (Java or C#), web programming (JavaScript 2015+), and Git. Good to have: TypeScript, React 18+, C# and .NET 5+, ORM interfacing, iOS development basics."
  },
  "source_url": "https://ca.indeed.com/viewjob?jk=cc47b74ea539a2d6&from=serp&vjs=3"
},
{
  "converted_data": {
    "job_title": "Backend Software Engineer",
    "company": "Resource Logistics, Inc.",
    "location": "Montréal, QC H3A 1L2",
    "salary": "$54–$55 an hour",
    "job_description": "Proficiency in Java and Python, strong experience with MySQL, familiarity with AWS, ability to troubleshoot production issues, and strong collaborative skills.",
    "requirements": "3+ years of experience as a backend developer, ideally with large systems; experience with distributed systems or large-scale data applications is a plus."
  },
  "source_url": "https://ca.indeed.com/viewjob?jk=3c5135bd693c9a04&from=serp&vjs=3"
}
]